In [1]:
import pandas as pd
import seaborn as sns

In [9]:
df = pd.read_csv('bmi.csv')

In [10]:
df.head()

  Sex   "Weight (lbs Sep)"   "Weight (lbs Apr)"   "BMI (Sep)"   "BMI (Apr)"
0   M                159.0                  130          0.00         18.14
1   M                214.0                  190         19.70         17.44
2   M                163.0                  152         24.09         22.43
3   M                205.0                  194         26.97         25.57
4   F                150.0                  141         21.51         20.10

In [13]:
dict_df = {'A': [1, 3, 5, 7], 'B': [2, 4, 6, 8]}
my_own_df = pd.DataFrame(dict_df)
my_own_df.head()

   A  B
0  1  2
1  3  4
2  5  6
3  7  8

In [15]:
renamed_df = my_own_df.rename(index=str, columns={'A': "Odds", 'B': "Evens"})
renamed_df.head()

   Odds  Evens
0     1      2
1     3      4
2     5      6
3     7      8

In [16]:
my_own_df.head()

   A  B
0  1  2
1  3  4
2  5  6
3  7  8

In [19]:
# Converting data types
number_list = ['0', '0.2', '2e-3']
numbers = pd.to_numeric(number_list)

[type(a) for a in numbers]

[numpy.float64, numpy.float64, numpy.float64]

In [ ]:
dummy_df = pd.get_dummies()